clc, clear, close all
% 内燃机转角与升程插值模型
% 求转角度数从91度到130度每隔1度的升程
% 这是个一元插值问题，在MATLAB中，采用双三次插值法“cubic”
% 易求得转角从91度到130度每隔1度的升程
% x=[91, 105, 110, 115, 120, 124, 128] % 转角数据
% h=[0, 1.0869, 1.9710, 2.7555, 3.3986, 4.9073, 8.3409] % 对应的升程数据
% j=1
% for i=91:130
%     y(1, j)=interp1(x, h, i, 'cubic'); % 一维数据插值法，cubic为多项式插值，拟合出的数据较平滑
%     j=j+1
% end
% x1=91:130
% plot(x, h, 'r')
% hold on
% plot(x1, y, 'o')

% 航行区域警示线模型
% 给出相关海域每一点(x,y)对应的水深z
% 1.使数组x和y产生网格，以绘制3D曲面
% 2.x和y平面设置好后，使用griddata()对矩形海域内的格点样条函数内插，得到水深z
% 3.mesh()作图，绘出该海域的地貌图
% 4.contour()绘制等位线(等高线)，并用contour()标识等位线所处位置的深度值
% 5.对于特殊的等位线(航海警示线)，再次使用contour()绘制警示线，运用gtext()标识不同吨位的警示线

x=[129, 140, 103.5, 88, 185.5, 195, 105.5, 157.5, 107.5, 77, 81, 162, 162, 117.5];
y=[7.5, 141.5, 23, 147, 22.5, 137.5, 85.5, -6.5, -81, 3, 56.5, -66.5, 84, -33.5];
z=[4, 8, 6, 8, 6, 8, 8, 9, 9, 8, 8, 9, 4, 9];
x1=75:0.5:200; % 所求海域x的范围
y1=-50:0.5:150; % 所求海域y的范围
[x2, y2]=meshgrid(x1, y1); % 从x,y得到网格，以便绘制3D曲面 
z2=griddata(x, y, z, x2, y2, 'v4'); % v4表示格点样条函数内插，拟合f(x,y)
subplot(1,3,1)
mesh(x2, y2, z2)
hold on
C=contour(x2, y2, z2)
clabel(C)
subplot(1, 3, 2)
C=contour(x2, y2, z2)
clabel(C)
%[C, d]=contour(x2, y2, z2)
%clabel(C, d, 'manual')
grid on
hold on
subplot(1, 3, 3)
contour(x2, y2, z2, [4, 4, 4.5, 4.5, 5, 5, 5.5, 5.5])
title('警示线图')
hold on
xlabel('X'), ylabel('Y')
grid on
gtext('4吨的警戒线')
gtext('4.5吨的警戒线')
gtext('5吨的警戒线')
gtext('5.5吨的警戒线')