% 一平放的椭圆柱体形状的油罐，长度为L，横截面为一个椭圆
% 长半轴为a， 短半轴为b，求当油罐中油的高度为h时，油量是多少？
% 油的密度为p
% syms a b h y p m L
% m = sqrt(b^2 - y^2)
% m1 = int(m) % 求不定积分
% m2 = int(m,'-b','n') % 求定积分，下限为-b
% m3 = subs(m2, 'n', 'y') % 将m2中的符号n替换为y
% S = (2*a/b)*m3 % 椭圆中油所占空间横截面的面积
% simplify(S) % 化简代数表达式S
% V = S*L % 求得油所占面积的体积
% y = h-b
% V1 = subs(V, 'y', 'h-b')
% simplify(V1)
% m = V1 * p % 得到椭圆柱体中的油料质量



% 光的反射定理：光总是沿用时最短的光程传播
% 借助于符号变量证明入射角等于反射角
% syms H C K x % H为光影投下的截距，C为光速
% T = (H/C)*((1/cos(x))+[1+(K-tan(x))^2]^(1/2)) % T表示光从入射点到出射点的时间
% dfdx = diff(T,x) % 求时间T关于角度x的导数
% a = solve(dfdx, x) % 求解方程
% tan(a)



% 齐次线性方程组的通解，在Matlab中，使用null(A, 'r')来求解齐次方程
% 即求出 A·X = 0的解空间，r(A)为系数A的秩矩阵
% n为未知数的个数，若r(A)=n，则只有唯一解，r(A)<n则有非零解
% 非零解实际为求出解空间的一组基
% A = [1 2 2 1;
%      2 1 -2 -2;
%      1 -1 -4 -3] % 原始系数矩阵
%  format rat % 指定有理式格式表达，如使用分数形式表达小数
%  B = null(A, 'r') % 求解空间的有理基
%  B1 = rref(A) % 将A化为行最简阶梯型矩阵
%  syms k1 k2
%  X = k1*B(:,1) + k2*B(:,2) % 写出方程的通解
%  pretty(X) % 让通解表达式更精美
 


% 非齐次线性方程组的通解
A = [1 1 -3 -1;
     3 -1 -3 4;
     1  5 -9 -8]
b = [1 4 0]'
B = [A b]
n = 4 % 未知数个数
RA = rank(A) % 矩阵A的秩
RB = rank(B) % 矩阵B的秩
format rat
if RA == RB & RA == n % 判断是否有唯一解
    X = A \ b
elseif RA == RB & RA<n % 判断是否有无穷解
    X = A \ b % 求特解
    C = null(A, 'r') % 求AX=0的基础解系
else X='方程无解'
end
% 使用rref()求解该方程
D = rref(B) % 求增广矩阵的行最简阶梯型矩阵